Diplom/src/Documents/ВКМ_НачислениеЗаработнойПлаты/ВКМ_НачислениеЗаработнойПлаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_НачислениеЗаработнойПлаты</name>
  <registerRecords>CalculationRegister.ВКМ_Удержания</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_ОсновныеНачисления</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ОтпускаСотрудников</registerRecords>
  <tabularSections>
    <name>ОсновныеНачисления</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.ВКМ_ОсновныеНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГрафикРаботы</name>
      <type>
        <types>CatalogRef.ВКМ_ГрафикРаботы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеНачисления</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.ВКМ_ДополнительныеНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПремии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Diplom/src/ChartsOfCalculationTypes/ВКМ_ОсновныеНачисления/ВКМ_ОсновныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCalculationTypes>
  <name>ВКМ_ОсновныеНачисления</name>
  <baseCalculationTypes>ChartOfCalculationTypes.ВКМ_ОсновныеНачисления</baseCalculationTypes>
  <baseCalculationTypes>ChartOfCalculationTypes.ВКМ_ДополнительныеНачисления</baseCalculationTypes>
  <predefined>
    <items>
      <name>Оклад</name>
      <description>Оклад</description>
    </items>
    <items>
      <name>Отпуск</name>
      <description>Отпуск</description>
    </items>
  </predefined>
</mdclass:ChartOfCalculationTypes>

Diplom/src/Documents/ВКМ_НачислениеЗаработнойПлаты/ObjectModule.bsl
#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ,Режим)
	
	СформироватьДвиженияОсновныеНачисления();
	
	РасчитатьОклад();
	РасчитатьОтпуск();
	
	СформироватьДвижениеВзаиморасчетыССотрудником();	

КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции
Процедура СформироватьДвиженияОсновныеНачисления()

	Движения.ВКМ_ОсновныеНачисления.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_НачислениеЗаработнойПлатыОсновныеНачисления.Сотрудник,
		|	ВКМ_НачислениеЗаработнойПлатыОсновныеНачисления.ВидРасчета,
		|	ВКМ_НачислениеЗаработнойПлатыОсновныеНачисления.ДатаНачала,
		|	ВКМ_НачислениеЗаработнойПлатыОсновныеНачисления.ДатаОкончания,
		|	ВКМ_НачислениеЗаработнойПлатыОсновныеНачисления.ГрафикРаботы
		|ПОМЕСТИТЬ ВТ_Док
		|ИЗ
		|	Документ.ВКМ_НачислениеЗаработнойПлаты.ОсновныеНачисления КАК ВКМ_НачислениеЗаработнойПлатыОсновныеНачисления
		|ГДЕ
		|	ВКМ_НачислениеЗаработнойПлатыОсновныеНачисления.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВКМ_УсловияОплатыТрудаСрезПоследних.Сотрудник КАК Сотрудник,
		|	ЕСТЬNULL(ВКМ_УсловияОплатыТрудаСрезПоследних.Оклад, 0) КАК Оклад,
		|	ЕСТЬNULL(ВКМ_УсловияОплатыТрудаСрезПоследних.ПроцентОтРабот, 0) КАК ПроцентОтРабот,
		|	ВТ_Док.ГрафикРаботы
		|ПОМЕСТИТЬ ВТ_УсловияТруда
		|ИЗ
		|	РегистрСведений.ВКМ_УсловияОплатыТруда.СрезПоследних(&Дата,) КАК ВКМ_УсловияОплатыТрудаСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Док КАК ВТ_Док
		|		ПО ВТ_Док.Сотрудник = ВКМ_УсловияОплатыТрудаСрезПоследних.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Док.Сотрудник КАК Сотрудник,
		|	ВТ_УсловияТруда.Оклад КАК Оклад,
		|	ВТ_УсловияТруда.ПроцентОтРабот КАК Процент,
		|	ЕСТЬNULL(ВКМ_ВыполненныеСотрудникомРаботыОбороты.ЧасовКОплатеОборот, 0) КАК ЧасовКОплате,
		|	ЕСТЬNULL(ВКМ_ВыполненныеСотрудникомРаботыОбороты.СуммаКОплатеОборот, 0) КАК СуммаКОплате,
		|	ВТ_Док.ГрафикРаботы КАК ГрафикРаботы
		|ИЗ
		|	ВТ_УсловияТруда КАК ВТ_УсловияТруда,
		|	ВТ_Док КАК ВТ_Док
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы.Обороты(&ДатаНачала, &ДатаОкончания,,) КАК
		|			ВКМ_ВыполненныеСотрудникомРаботыОбороты
		|		ПО ВТ_Док.Сотрудник = ВКМ_ВыполненныеСотрудникомРаботыОбороты.Сотрудник";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца(Дата));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
		Движение.ПериодРегистрации = Дата;
		Движение.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
		Движение.ГрафикРаботы = ВыборкаДетальныеЗаписи.ГрафикРаботы;
		Движение.Показатель = ВыборкаДетальныеЗаписи.Оклад;
		Движение.Процент = ВыборкаДетальныеЗаписи.Процент;
		
		//Движение.ВКМ_ОтработаноЧасов = ВыборкаДетальныеЗаписи.ЧасовКОплате;
	
		//ЗаполнитьЗначенияСвойств(Движение, ВыборкаДетальныеЗаписи);
		
	КонецЦикла;
		
КонецПроцедуры

Процедура РасчитатьОклад()

		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ВКМ_ОсновныеНачисленияДанныеГрафика.НомерСтроки КАК НомерСтроки,
			|	ВКМ_ОсновныеНачисленияДанныеГрафика.ПериодДействия КАК Норма,
			|	ВКМ_ОсновныеНачисленияДанныеГрафика.ВКМ_ЗначениеФактическийПериодДействия КАК ФактическийПериодДействия
			|ИЗ
			|	РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(Регистратор = &Ссылка
			|	И ВидРасчета = &Оклад) КАК ВКМ_ОсновныеНачисленияДанныеГрафика";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("Оклад", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Движение = Движения.ВКМ_ОсновныеНачисления[ВыборкаДетальныеЗаписи.НомерСтроки - 1];
			Движение.ВКМ_ОтработаноЧасов = ВыборкаДетальныеЗаписи.ФактическийПериодДействия;
			
			РезультатБезНДФЛ = Движение.Показатель * ВыборкаДетальныеЗаписи.ФактическийПериодДействия;
			Движение.Результат = РезультатБезНДФЛ - (РезультатБезНДФЛ * 13 / 100);
			
			Если Движение.Процент <> 0 Тогда  //если процент не равен нулю добавим к результату данный процент
				Движение.Результат = Движение.Результат + (Движение.Результат * Движение.Процент / 100);
			КонецЕсли;
						
		КонецЦикла;
		
		Движения.ВКМ_ОсновныеНачисления.Записать(,Истина);
		
КонецПроцедуры

Процедура РасчитатьОтпуск()
	
	Движения.ВКМ_ОтпускаСотрудников.Записывать = Истина;
	
	//получаю временную таблицу сотрудников из документа НачислениеЗП
	//далее соединяю ВТ с Регистром расчета ОсновныеНачисления и ВзаиморасчетыССотрудниками 
	//устанавливаю периоды (получаю данные за 12 мес), помещаю в ВТ
	//далее две ВТ и регистр расчета но данные уже на дату документа
	//выше данные получаю через запрос, делаю проводку, расчитываю отпуск
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_НачислениеЗаработнойПлатыОсновныеНачисления.НомерСтроки,
		|	ВКМ_НачислениеЗаработнойПлатыОсновныеНачисления.Сотрудник,
		|	ВКМ_НачислениеЗаработнойПлатыОсновныеНачисления.ВидРасчета,
		|	ВКМ_НачислениеЗаработнойПлатыОсновныеНачисления.ДатаНачала,
		|	ВКМ_НачислениеЗаработнойПлатыОсновныеНачисления.ДатаОкончания
		|ПОМЕСТИТЬ ВТ_Док
		|ИЗ
		|	Документ.ВКМ_НачислениеЗаработнойПлаты.ОсновныеНачисления КАК ВКМ_НачислениеЗаработнойПлатыОсновныеНачисления
		|ГДЕ
		|	ВКМ_НачислениеЗаработнойПлатыОсновныеНачисления.Ссылка = &Ссылка
		|	И ВКМ_НачислениеЗаработнойПлатыОсновныеНачисления.ВидРасчета = &ВидРасчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Док.Сотрудник КАК Сотрудник,
		|	СУММА(ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеФактическийПериодДействия) КАК
		|		ВКМ_ЗначениеФактическийПериодДействия,
		|	СУММА(ВКМ_ОсновныеНачисленияДанныеГрафика.Результат) КАК Результат,
		|	СУММА(ВКМ_ВзаиморасчетыССотрудникамиОбороты.СуммаОборот) КАК СуммаОборот
		|ПОМЕСТИТЬ ВТ_ПериодОклад
		|ИЗ
		|	ВТ_Док КАК ВТ_Док
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(БазовыйПериодНачало = МЕСЯЦ(&ДатаНачала)
		|		И БазовыйПериодКонец = МЕСЯЦ(&ДатаОкончания)) КАК ВКМ_ОсновныеНачисленияДанныеГрафика
		|		ПО ВТ_Док.Сотрудник = ВКМ_ОсновныеНачисленияДанныеГрафика.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Обороты(&ДатаНачала, &ДатаОкончания,,) КАК
		|			ВКМ_ВзаиморасчетыССотрудникамиОбороты
		|		ПО ВТ_Док.Сотрудник = ВКМ_ВзаиморасчетыССотрудникамиОбороты.Сотрудник
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Док.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Док.Сотрудник КАК Сотрудник,
		|	ВТ_ПериодОклад.ВКМ_ЗначениеФактическийПериодДействия КАК ФактическийПериодДействияЗаПериод,
		|	ВКМ_ОсновныеНачисленияДанныеГрафика.НомерСтроки КАК НомерСтроки,
		|	ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеФактическийПериодДействия КАК ФактическийПериодДействия,
		|	ВТ_ПериодОклад.СуммаОборот КАК СуммаОборот
		|ИЗ
		|	ВТ_Док КАК ВТ_Док
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПериодОклад КАК ВТ_ПериодОклад
		|		ПО ВТ_Док.Сотрудник = ВТ_ПериодОклад.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(ПериодРегистрации = &Дата) КАК
		|			ВКМ_ОсновныеНачисленияДанныеГрафика
		|		ПО ВТ_Док.Сотрудник = ВКМ_ОсновныеНачисленияДанныеГрафика.Сотрудник";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ВидРасчета", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск);
	Запрос.УстановитьПараметр("БазовыйПериодНачало", (Месяц(Дата) - 12));
	Запрос.УстановитьПараметр("БазовыйПериодКонец", Месяц(Дата));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		//Движение по регистру расчета ОсновныеНачисления
		Движение = Движения.ВКМ_ОсновныеНачисления[ВыборкаДетальныеЗаписи.НомерСтроки - 1];			
		Движение.Результат = (ВыборкаДетальныеЗаписи.СуммаОборот / ВыборкаДетальныеЗаписи.ФактическийПериодДействияЗаПериод) / ВыборкаДетальныеЗаписи.ФактическийПериодДействия;
		
		//движение по регистру накопления ОтпускаСотрудников
		Движение = Движения.ВКМ_ОтпускаСотрудников.Добавить();
		Движение.Период = Дата;
		//Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
		//списываю количество дней отпуска, для получения в дальнейшем отчета
		Движение.КоличествоДней = ВыборкаДетальныеЗаписи.ФактическийПериодДействия;

	КонецЦикла;
	
	Движения.ВКМ_ОсновныеНачисления.Записать(,Истина);

КонецПроцедуры

Процедура СформироватьДвижениеВзаиморасчетыССотрудником()

	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	
	//из запроса получаю сумму с учетом периодов, далее делаю приход		
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_НачислениеЗаработнойПлатыОсновныеНачисления.Сотрудник КАК Сотрудник,
		|	ЕСТЬNULL(ВКМ_ОсновныеНачисления.Результат, 0) КАК Результат
		|ИЗ
		|	Документ.ВКМ_НачислениеЗаработнойПлаты.ОсновныеНачисления КАК ВКМ_НачислениеЗаработнойПлатыОсновныеНачисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
		|		ПО ВКМ_НачислениеЗаработнойПлатыОсновныеНачисления.Сотрудник = ВКМ_ОсновныеНачисления.Сотрудник
		|		И ВКМ_НачислениеЗаработнойПлатыОсновныеНачисления.ДатаНачала = ВКМ_ОсновныеНачисления.БазовыйПериодНачало
		|		И ВКМ_НачислениеЗаработнойПлатыОсновныеНачисления.ДатаОкончания = ВКМ_ОсновныеНачисления.ПериодДействияКонец
		|ГДЕ
		|	ВКМ_НачислениеЗаработнойПлатыОсновныеНачисления.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
		Движение.Сумма = ВыборкаДетальныеЗаписи.Результат;
		
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти
